20260131095325-obtaining_substrings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Obtaining Substrings</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Obtaining Substrings</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgba3b629">1. Obtaining Substrings</a>
<ul>
<li><a href="#org36c1362">1.1. Example,</a>
<ul>
<li><a href="#orga1bf116">1.1.1. Note</a></li>
<li><a href="#org4e4c51f">1.1.2. Finding a Character or a Substring in a String</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgba3b629" class="outline-2">
<h2 id="orgba3b629"><span class="section-number-2">1.</span> Obtaining Substrings</h2>
<div class="outline-text-2" id="text-1">
<p>
You can obtain a single character from a <code>string</code> using the <code>charAt</code> method.
You can also obtain a <b>substring</b> from a <code>string</code> using the <code>substring</code> method.
</p>
</div>

<div id="outline-container-org36c1362" class="outline-3">
<h3 id="org36c1362"><span class="section-number-3">1.1.</span> Example,</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">String message = "Welcome to Java";
message = message.substring(0,11) + "HTML";
</pre>
</div>

<p>
The string message now becomes <code>Welcome to HTML</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">substring(beginIndex)</td>
<td class="org-left">Returns this string’s substring starting at beginIndex and extending to the end of the string.</td>
<td class="org-left">"programming".substring(3) → "gramming"</td>
</tr>

<tr>
<td class="org-left">substring(beginIndex, endIndex)</td>
<td class="org-left">Returns this string’s substring starting at beginIndex and ending at endIndex − 1 (endIndex not included).</td>
<td class="org-left">"programming".substring(3, 7) → "gram"</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orga1bf116" class="outline-4">
<h4 id="orga1bf116"><span class="section-number-4">1.1.1.</span> Note</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
If <code>beginIndex</code> is <code>endIndex</code>, <code>substring(beginIndex, endIndex)</code> returns an <code>empty</code> <b>string</b> with length <code>0</code>.
If <code>beginIndex</code> <code>&gt;</code> <code>endIndex</code>, it would be a <b>runtime</b> <b>error</b>.
</p>
</div>
</div>

<div id="outline-container-org4e4c51f" class="outline-4">
<h4 id="org4e4c51f"><span class="section-number-4">1.1.2.</span> Finding a Character or a Substring in a String</h4>
<div class="outline-text-4" id="text-1-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">indexOf(ch)</td>
<td class="org-left">Returns the index of the first occurrence of ch; −1 if not found.</td>
<td class="org-left">"banana".indexOf('a') → 1</td>
</tr>

<tr>
<td class="org-left">indexOf(ch, fromIndex)</td>
<td class="org-left">Returns the first occurrence of ch after fromIndex; −1 if not found.</td>
<td class="org-left">"banana".indexOf('a', 2) → 3</td>
</tr>

<tr>
<td class="org-left">indexOf(s)</td>
<td class="org-left">Returns the index of the first occurrence of string s; −1 if not found.</td>
<td class="org-left">"banana".indexOf("na") → 2</td>
</tr>

<tr>
<td class="org-left">indexOf(s, fromIndex)</td>
<td class="org-left">Returns the first occurrence of string s after fromIndex; −1 if not found.</td>
<td class="org-left">"banana".indexOf("na", 3) → 4</td>
</tr>

<tr>
<td class="org-left">lastIndexOf(ch)</td>
<td class="org-left">Returns the index of the last occurrence of ch; −1 if not found.</td>
<td class="org-left">"banana".lastIndexOf('a') → 5</td>
</tr>

<tr>
<td class="org-left">lastIndexOf(ch, fromIndex)</td>
<td class="org-left">Returns the last occurrence of ch before fromIndex; −1 if not found.</td>
<td class="org-left">"banana".lastIndexOf('a', 4) → 3</td>
</tr>

<tr>
<td class="org-left">lastIndexOf(s)</td>
<td class="org-left">Returns the index of the last occurrence of string s; −1 if not found.</td>
<td class="org-left">"banana".lastIndexOf("na") → 4</td>
</tr>

<tr>
<td class="org-left">lastIndexOf(s, fromIndex)</td>
<td class="org-left">Returns the last occurrence of string s before fromIndex; −1 if not found.</td>
<td class="org-left">"banana".lastIndexOf("na", 3) → 2</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="org8df123c"></a>Examples<br />
<div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">
<pre class="src src-java">"Welcome to Java".indexOf('W') returns 0.
"Welcome to Java".indexOf('o') returns 4.
"Welcome to Java".indexOf('o', 5) returns 9.
"Welcome to Java".indexOf("come") returns 3.
"Welcome to Java".indexOf("Java", 5) returns 11.
"Welcome to Java".indexOf("java", 5) returns −1.
"Welcome to Java".lastIndexOf('W') returns 0.
"Welcome to Java".lastIndexOf('o') returns 9.
"Welcome to Java".lastIndexOf('o', 5) returns 4.
"Welcome to Java".lastIndexOf("come") returns 3.
"Welcome to Java".lastIndexOf("Java", 5) returns −1.
"Welcome to Java".lastIndexOf("Java") returns 11.
</pre>
</div>

<p>
Suppose that a <code>string s</code> contains the first and last name separated by a <b>space</b>.
You can use the following code to extract the first and last name from the string:
</p>

<div class="org-src-container">
<pre class="src src-java">int k = s.indexOf(' ');
String firstName = s.substring(0, k);
String lastName = s.substring(k + 1);
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
